# Customer Segmentation Project.

# Case Study

It has always been important for businesses to understand customer behaviours in order to ensure that products or services are tailored towards maximum profitability. For this case study, we will refer to a dataset with customer shopping data on customer’s gender, city, customer‘s annual income, credit score, and spending score found here. This data was obtained on several cities in India as will be seen in the dataset. Data visualization will be done (in Python) to make comparisons between the different features of the dataset.

#  1. Defining the Goal of Customer Segmentation

Customer Segmentation is the process of division of customer base into several groups of individuals that share a similarity in different ways that are relevant to marketing. Behaviour leads to Customer Segmentation, why Using clustering, companies, Malls, supermarkets and Restaurants can identify segments of customers to target the potential user base. We will divide customers into groups according to common characteristics like gender, city, customer‘s annual income, credit score, and spending score. Through this we get deeper understanding of the customer preferences as well as the requirements for discovering valuable segments that would help us gain maximum profit for the company.
secondly we strategize the marketing techniques more efficiently and reduce the risk of investment.

#  2. Get the Data

We need to understand the data set in detail. We develop a brief understanding of the data set of which we will be working with. For example how many features are there in the data set , how many unique labels, How are they distributed or how are the labels distributed.

In [1]:
#We import the libraries and tabular Dataset that we intend to use in developing our model project.
import pandas as pd
import numpy as np

# Load the Data set.

In [2]:
#We now load the data set.

In [3]:
Data=pd.read_csv("C:\\Users\\nongaya\\Desktop\\Jenga-Project\\Mall_Customers.csv",header="infer")# we now read the data.

In [4]:
Data

     CustomerID  Gender  Age  Annual Income (k$)  Spending Score (1-100)
0             1    Male   19                  15                      39
1             2    Male   21                  15                      81
2             3  Female   20                  16                       6
3             4  Female   23                  16                      77
4             5  Female   31                  17                      40
..          ...     ...  ...                 ...                     ...
195         196  Female   35                 120                      79
196         197  Female   45                 126                      28
197         198    Male   32                 126                      74
198         199    Male   32                 137                      18
199         200    Male   30                 137                      83

[200 rows x 5 columns]

In [5]:
Data.head()# we explore the headers on the datasets to understand the features.

   CustomerID  Gender  Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male   19                  15                      39
1           2    Male   21                  15                      81
2           3  Female   20                  16                       6
3           4  Female   23                  16                      77
4           5  Female   31                  17                      40

In [6]:
Data.tail()# we explore the tail on the datasets to understand it. Shows the bottom Data in the set

     CustomerID  Gender  Age  Annual Income (k$)  Spending Score (1-100)
195         196  Female   35                 120                      79
196         197  Female   45                 126                      28
197         198    Male   32                 126                      74
198         199    Male   32                 137                      18
199         200    Male   30                 137                      83

In [7]:
Data.tail().T# We explore the data sets to check on the headers conformity and understand it.

                           195     196   197   198   199
CustomerID                 196     197   198   199   200
Gender                  Female  Female  Male  Male  Male
Age                         35      45    32    32    30
Annual Income (k$)         120     126   126   137   137
Spending Score (1-100)      79      28    74    18    83

In [8]:
Data.sample(10)

     CustomerID  Gender  Age  Annual Income (k$)  Spending Score (1-100)
177         178    Male   27                  88                      69
167         168  Female   33                  86                      95
87           88  Female   22                  57                      55
152         153  Female   44                  78                      20
181         182  Female   32                  97                      86
68           69    Male   19                  48                      59
20           21    Male   35                  24                      35
0             1    Male   19                  15                      39
61           62    Male   19                  46                      55
24           25  Female   54                  28                      14

In [9]:
Data.T# we visualize the data set in tabular form

,0,1,2,3,4,5,6,7,8,9,...,190,191,192,193,194,195,196,197,198,199
CustomerID,1,2,3,4,5,6,7,8,9,10,...,191,192,193,194,195,196,197,198,199,200
Gender,Male,Male,Female,Female,Female,Female,Female,Female,Male,Female,...,Female,Female,Male,Female,Female,Female,Female,Male,Male,Male
Age,19,21,20,23,31,22,35,23,64,30,...,34,32,33,38,47,35,45,32,32,30
Annual Income (k$),15,15,16,16,17,17,18,18,19,19,...,103,103,113,113,120,120,126,126,137,137
Spending Score (1-100),39,81,6,77,40,76,6,94,3,72,...,23,69,8,91,16,79,28,74,18,83

# 3. Clean the Data.

In [10]:
Data.isnull().sum()#Check if there are any missing values.

CustomerID                0
Gender                    0
Age                       0
Annual Income (k$)        0
Spending Score (1-100)    0
dtype: int64

In [14]:
# This shows our data set does not have any missing values which means its clean.

In [11]:
len(Data)#Shows how much data the Dataset contains:

200

In [12]:
Data.info() #This displays all columns and their data types,

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 5 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   CustomerID              200 non-null    int64
 1   Gender                  200 non-null    object
 2   Age                     200 non-null    int64
 3   Annual Income (k$)      200 non-null    int64
 4   Spending Score (1-100)  200 non-null    int64
dtypes: int64(4), object(1)
memory usage: 7.9+ KB

In [13]:
Data.describe()# This shows you some basic descriptive statistics for all numeric columns in the data set.which includes the count,mean,standard deviation,min and max

       CustomerID         Age  Annual Income (k$)  Spending Score (1-100)
count  200.000000  200.000000          200.000000              200.000000
mean   100.500000   38.850000           60.560000               50.200000
std     57.879185   13.969007           26.264721               25.823522
min      1.000000   18.000000           15.000000                1.000000
25%     50.750000   28.750000           41.500000               34.750000
50%    100.500000   36.000000           61.500000               50.000000
75%    150.250000   49.000000           78.000000               73.000000
max    200.000000   70.000000          137.000000               99.000000